spec/dummy/app/controllers/facets_controller.rb

  def create
    @facet = Facet.new(params[:facet])
    @facet.catalog_id = @catalog.id
    if @facet.save
---
INSERT INTO "facets" ("caption", "catalog_id", "color", "label_order", "order", "position") VALUES (?, ?, ?, ?, ?, ?)  [["caption", "TestFacet"], ["catalog_id", 1], ["color", nil], ["label_order", nil], ["order", nil], ["position", nil]]

  def edit
    @facet = @catalog.facets.find(params[:id])
---
SELECT "facets".* FROM "facets" WHERE "facets"."catalog_id" = 1 AND "facets"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    if params[:facet][:caption].blank?
      flash[:error] = "Facet could not be updated! Caption cannot be empty"
      redirect_to :back
      return
    end
    @facet = @catalog.facets.find(params[:id])
    if @facet.update_attributes(params[:facet])
---
SELECT "facets".* FROM "facets" WHERE "facets"."catalog_id" = 1 AND "facets"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "facets" SET "caption" = 'TestFacetUpdated' WHERE "facets"."id" = 1

  def destroy
    @catalog = @catalog.facets.find(params[:id])
    @catalog.destroy
---
SELECT "facets".* FROM "facets" WHERE "facets"."catalog_id" = 1 AND "facets"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "facets" WHERE "facets"."id" = ?  [["id", 2]]

  def find_catalog
    @catalog = Catalog.find(params[:catalog_id])
---
SELECT "catalogs".* FROM "catalogs" WHERE "catalogs"."id" = ? LIMIT 1  [["id", "1"]]